views/layouts/main.php

SELECT * FROM "user" WHERE id = 3
---
                            </div>
                        </li>-->
                        <li class="nav-item dropdown">
                            <a class="nav-link dropdown-toggle text-muted waves-effect waves-dark" href="" data-toggle="dropdown" aria-haspopup="true" aria-expanded="false"><img src="<?php echo Yii::$app->request->baseUrl; ?>/foto/<?= User::find()->where('id = '.Yii::$app->user->identity->id)->one()->foto; ?>" alt="user" class="profile-pic" /></a>

SELECT * FROM "user" WHERE id = 3
---
                                <ul class="dropdown-user">
                                    <li>
                                        <div class="dw-user-box">
                                            <div class="u-img"><img src="<?php echo Yii::$app->request->baseUrl; ?>/foto/<?= User::find()->where('id = '.Yii::$app->user->identity->id)->one()->foto; ?>" alt="user"></div>

SELECT * FROM "user" WHERE id = 3
---
            <div class="scroll-sidebar">
                <!-- User profile -->
                <div class="user-profile" style="background: url(<?php echo Yii::$app->request->baseUrl; ?>/material/assets/images/background/user-info.jpg) no-repeat;">
                    <!-- User profile image -->
                    <div class="profile-img"> <img src="<?php echo Yii::$app->request->baseUrl; ?>/foto/<?= User::find()->where('id = '.Yii::$app->user->identity->id)->one()->foto; ?>"  alt="user" /> </div>

SELECT COUNT(*) FROM "konsultasi"
---
                            <div class="d-flex m-r-20 m-l-10 hidden-md-down">
                                <div class="chart-text m-r-10">
                                    <h6 class="m-b-0"><small>KONSULTASI</small></h6>
                                    <h4 class="m-t-0 text-info"><i class="ti-heart-broken"></i> <?= Konsultasi::find()->count(); ?></h4></div>

SELECT COUNT(*) FROM "user"
---
                            <div class="d-flex m-r-20 m-l-10 hidden-md-down">
                                <div class="chart-text m-r-10">
                                    <h6 class="m-b-0"><small>PENGGUNA</small></h6>
                                    <h4 class="m-t-0 text-primary"><i class="ti-user"></i> <?= User::find()->count(); ?></h4></div>