controllers/KonsultasiController.php

	public function actionMulai()
    {
        $idaturan=Aturan::find()->orderBy('id_aturan')->one()->id_aturan;
---
SELECT * FROM "aturan" ORDER BY "id_aturan"

    public function actionCreate()
    {
        $model = new Konsultasi();

        if ($model->load(Yii::$app->request->post())) {
			$model->tanggal=date('Y-m-d H:i:s');
			$model->id_user=Yii::$app->user->id;
			$model->kode_diagnosa=Null;
			$model->hasil_cf=Null;
			if($model->save()){
---
INSERT INTO "konsultasi" ("nama_penderita", "jenis_penderita", "usia_penderita", "alamat_penderita", "tanggal", "id_user", "kode_diagnosa", "hasil_cf") VALUES ('Sapi Mas Hanan', 'Sapi', 24, 'Yogyakarta', '2019-08-14 05:11:38', 3, NULL, NULL) RETURNING "id_konsultasi"