controllers/SiteController.php

    public function actionLogin()
    {
		$this->layout = 'm_login';
        $model = new LoginForm();
        if ($model->load(Yii::$app->request->post())) {
			$user = User::find()
				->where([
					'username' => Yii::$app->request->post('LoginForm')['username'],
					'password' => User::hide('en',Yii::$app->request->post('LoginForm')['password']),
					'status' => 1
				])
				->one();
---
SELECT * FROM "user" WHERE ("username"='petugas') AND ("password"='NGZHTkpiU0RQN0l3U2tKREZ0QXhMdz09') AND ("status"=1)

    public function actionKode()
    {
		$ctrl1=ucwords(Yii::$app->request->queryParams['r'] );
		$ctrl=explode("/", $ctrl1);
		if($ctrl[0]=='Gejala' || $ctrl[0]=='Diagnosa'){
			if($ctrl[0]=='Gejala')
				$cari=Gejala::find()->orderBy("kode DESC")->one()->kode;
			else
				$cari=Diagnosa::find()->orderBy("kode DESC")->one()->kode;
---
SELECT * FROM "gejala" ORDER BY "kode" DESC
SELECT * FROM "diagnosa" ORDER BY "kode" DESC

	public function actionNoPengetahuan()
    {
		if(!empty(Yii::$app->session['id_konsultasi']))
			$s_konsultasi=Yii::$app->session['id_konsultasi'];
		else
			$s_konsultasi=Yii::$app->request->queryParams['id'];
		IF(!empty($s_konsultasi))
			$model=Konsultasi::find()->where('id_konsultasi = :id_konsultasi', [':id_konsultasi' => $s_konsultasi])->one();
---
SELECT * FROM "konsultasi" WHERE id_konsultasi = '25'