views/site/c_hasil.php

SELECT * FROM "hasil_konsultasi" WHERE id_konsultasi = '25' ORDER BY "id_hasil_konsultasi"
SELECT * FROM "hasil_konsultasi" WHERE (id_konsultasi = '25') AND (jawaban = 1) ORDER BY "id_hasil_konsultasi"
---
			$s_konsultasi=Yii::$app->session['id_konsultasi'];
		else
			$s_konsultasi=Yii::$app->request->queryParams['id'];
	$riwayat = HasilKonsultasi::find()
		->where('id_konsultasi = :s_konsultasi', [':s_konsultasi' => $s_konsultasi])
		->orderBy('id_hasil_konsultasi')
		->all();
	$tabs = HasilKonsultasi::find()
		->where('id_konsultasi = :s_konsultasi', [':s_konsultasi' => $s_konsultasi])
		->andWhere('jawaban = :jawaban', [':jawaban' => 1])
		->orderBy('id_hasil_konsultasi')
		->all();