views/aturan/_form.php

SELECT * FROM "gejala"
SELECT * FROM "v_list_aturan"
---

    JIKA
	<?php
		$gejala=Gejala::find()->all();
		$mix=VListAturan::find()->all();