views/aturan/index.php

				'value'=>function($data){
					if(!empty($data->ya) && !empty($data->tidak)){
						if($data->ya[0]=="G"){
							$y = Gejala::find()
								->where(['kode' => $data->ya])
								->one()->nama;
---
SELECT * FROM "gejala" WHERE "kode"='G002'

							$y="Tidak Cukup Pengetahuan";
						}
						if($data->tidak[0]=="G"){
							$t = Gejala::find()
								->where(['kode' => $data->tidak])
								->one()->nama;
						}elseif($data->tidak[0]=="D"){
							$t = Diagnosa::find()
								->where(['kode' => $data->tidak])
								->one()->nama;
---
SELECT * FROM "gejala" WHERE "kode"='G021'
SELECT * FROM "diagnosa" WHERE "kode"='D004'