views/aturan/view.php

SELECT * FROM "aturan" WHERE kode_gejala = 'G003'
---
		if($model->ya!=null){
    		$kode_y=$model->ya[0];
    		if($kode_y=='G')
    			$url_y=Aturan::find()->where('kode_gejala = :kode_gejala', [':kode_gejala' => $model->ya])->one()->id_aturan;

SELECT * FROM "gejala" WHERE "kode"='G002'
SELECT * FROM "aturan" WHERE kode_gejala = 'G020'
---
		if($model->tidak!=null){
		$kode_t=$model->tidak[0];
    		if($kode_t=='G')
    			$url_t=Aturan::find()->where('kode_gejala = :kode_gejala', [':kode_gejala' => $model->tidak])->one()->id_aturan;